::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::


::
:: 输出信息
::
echo ""
echo "[windows_64] Start build project"
echo ""


::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::


::
:: 创建目录
::
mkdir windows_64 && pushd windows_64


::
:: 生成make
::
cmake	../../ \
		\
		-G "Visual Studio 15 2017 Win64" \
		\
		-DCMAKE_BUILD_TYPE=Release \
		-DCMAKE_VERBOSE_MAKEFILE=ON


::
:: 返回上级目录
::
popd


::
:: 编译
::
cmake --build windows_64 --config Release -- -j 4


::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::


::
:: 输出信息
::
echo ""
echo "[windows_64] End build project"
echo ""


::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
