::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::


::
:: 输出信息
::
echo ""
echo "[windows_32] Start build project"
echo ""


::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::


::
:: 创建目录
::
mkdir windows_32 && pushd windows_32


::
:: 生成make
::
cmake	../../ \
		\
		-G "Visual Studio 15 2017" \
		\
		-DCMAKE_BUILD_TYPE=Release \
		-DCMAKE_VERBOSE_MAKEFILE=ON


::
:: 返回上级目录
::
popd


::
:: 编译
::
cmake --build windows_32 --config Release -- -j 4


::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::


::
:: 输出信息
::
echo ""
echo "[windows_32] End build project"
echo ""


::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
